{
  "education": [
    {
      "awards_achievements": [
        "President's Entrance Scholarship",
        "Samuel Eckler Memorial Scholarship in Actuarial Science",
        "GPA: 3.31/4.0"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Actuarial Science, Statistics, and Computer Science",
      "duration": "2017-2021",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AndrewChew",
  "highlighted_projects": [
    {
      "description": "Applied key concepts in AI to develop solvers for 3 games using python attaining a final grade of 94. Strategized and developed heuristics to improve runtime performance of solvers by over 75%.",
      "git_url": null,
      "name": "Sokoban, Othello, and Tenner Grid AI Solver"
    },
    {
      "description": "Managed a team of 3 to identify and analyze 4 large datasets, investigating the relationship between emissions and methods of transportation. Led tutorial sessions introducing RStudio and Version Control via GitHub integration to facilitate collaboration between team members. Designed 3 interactive data visualizations using psychological principles to effectively present and communicate key findings. Rapidly learned and applied the Shiny R package within a week to deliver infographic publicly by deploying a Shiny App online.",
      "git_url": "https://github.com/Andrew-Chew/STA313W21-Project",
      "name": "Data Visualization Project on Climate Change"
    },
    {
      "description": "Developed an R program to produce a cross-stitch pattern from an image using k-means clustering attaining a final grade of 88. Compiled a self-contained non-technical pdf document using Rmd demonstrating the process of the program and how to use it.",
      "git_url": null,
      "name": "Cross-Stitch Image Processing Project"
    },
    {
      "description": "Scraped over 4 million tweets to build a dataset to analyze consumer sentiment during the pandemic in a team of 4. Performed data analysis to identify new terms relating to the pandemic and how they relate to consumer sentiment using machine learning techniques in python.",
      "git_url": null,
      "name": "Twitter Sentiment during COVID-19 Project"
    },
    {
      "description": "Managed a team of 3 to fully develop a restaurant point of sale system in java utilizing fundamental OOP concepts. Built a fully functioning GUI using JavaFX. Effectively identified and fixed core issues in the code base using vigorous unit testing to improve user experience.",
      "git_url": null,
      "name": "Restaurant POS System Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring Agent allowing the Jarvis Linux Cluster Administration team to obtain server hardware and usage statistics in real time. Provisioned a psql instance using a docker container to persist data and designed a bash agent to be installed on servers to collect and insert data into the database. Implemented 3 SQL queries to answer business questions. Collaborated with the development team using the Agile workflow.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitoring Agent"
    },
    {
      "description": [
        "Twitter App: Not Started",
        "JDBC App: Developed a java Maven project to implement DAO patterns to CRUD to and from a psql database provisioned using docker.",
        "Grep App: Developed a java Maven project to perform regex pattern matching on files in a given directory. Leveraged the log4j and slf4j packages to log error messages."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Andrew Chew",
  "others": [
    {
      "bullets": [
        "Coursera Data Scientist Toolbox (2020)",
        "Coursera R Programming (2020)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Pianist",
        "Ultimate Frisbee Player",
        "Nature Enthusiast"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Develop software using the SDLC process in an agile work environment, delivering high-quality products. Spearheaded daily scrum meetings as team lead for a sprint.",
      "duration": "2021-present",
      "title": "Junior Software \u0026 Data Engineer"
    },
    {
      "company": "Loblaw Companies Limited",
      "description": "Advise customers on over 400 products leading to improved customer satisfaction. Effectively handle conflict resolution in a sensitive and professional manner ensuring safety in the workplace. Train new employees for day-to-day operations. Successfully completed diversity training.",
      "duration": "2016-present",
      "title": "Produce Clerk Part-Time"
    },
    {
      "company": "Hope United Church",
      "description": "Managed a team of 3 to organize after-school activities for 10 children. Strategized learning sessions for grade school children in Mathematics and Science. Taught children basic piano skills.",
      "duration": "2012-2016",
      "title": "Events Coordinator"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Maven",
      "JDBC",
      "Python",
      "LateX",
      "Google Workspace"
    ],
    "familiar": [
      "Google Cloud Platform",
      "VNC",
      "Log4j/Slf4j",
      "JavaFX",
      "C",
      "Verilog"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub/GitFlow",
      "R/R Markdown",
      "Microsoft Office Suite"
    ]
  },
  "summary": "I am a recent graduate from the University of Toronto with a background in software development, data analytics, and have over 5 years of customer service experience. I am highly adaptive to new environments and always looking for opportunities to enhance my capabilities. Currently, I am working as a Junior Software and Data Engineer at Jarvis Consulting Group where I work with my team in an agile environment to deliver high quality software products. I believe that the software industry is moving at an incredibly rapid pace with new innovations and technologies being discovered every day. I am excited to pursue my two biggest passions in software and data engineering to join this ever-evolving community, utilizing big data to design products to make the world a better and infinitely more interesting place."
}
